{"pages":[{"title":"","text":"Andrew OgrenHi, I’m Andrew. Welcome to my blog. I created this with the knowledge that likely no one will ever read it. However, if you’re interested in what I’m reading, what I’m thinking, or what I’m eating, you’ve come to the right place. I’m currently a software engineer at Grubhub. I studied computer science at Dartmouth College. If you’re interested in what I’m up to, connect with me on LinkedIn. Or email me at andrewogren02@gmail.com.","link":"/about/index.html"}],"posts":[{"title":"Why We Sleep","text":"Rating: 7/10 This book truly serves a mission: it wants to get you so scared about missing a good night sleep that you wouldn&apos;t dare stay up late again. The book is divided up into sections and depending where your interests lie, you may skip around. I decided to read straight through, but that&apos;s just me. Roughly, there are four sections with the first describing what sleep is and how it&apos;s regulated in the body, the second describing why you should sleep, the third section delving into dreams, and the fourth section talking about disorders caused by poor sleep. The book starts off strong talking about all of the parts of the brain that help regulate sleep as well as the types of sleep stages. While many people will already know about terms like REM/NREM sleep and circadian rhythym, he goes beyond the basics and really blew my mind with all of the things happening in your brain while you sleep. This section was the best part of the book by far. The second section was the literary equivalent of a Scared Straight program. I can save you the trouble of reading this section and let you know that Matthew Walker (the author) really wants you to know that lack of sleep will kill you. The third section revolved around dreams. Dreams are extremely cool, and so I had high hopes for this section. Unfortunately, I was a bit let down. While there are some interesting studies being conducted and it&apos;s clear that dreams are very important to memory retention and our overall mental health, there are no answers to why we dream about certain things. Additonally, there&apos;s no explanation for how some people remember their dreams and others do not. The fourth section was about sleep diseases and impacts on our health from lack of sleep. Aside from some interesting discussion of insomnia and PTSD, once again, the rest could be summed up as &quot;your body will function way worse when you don&apos;t get a lot of sleep&quot;. Anything you can think of, Overall, this was a 7/10 because the first half of the book was very interesting, and he does point out that you can read whatever sections of the book you want. In retrospect, if I had just read the first section, it would have been a 10.","link":"/2020/05/31/sleep/"}],"tags":[],"categories":[{"name":"Reading","slug":"Reading","link":"/categories/Reading/"}]}